base/Documents/бит_ЗакрытиеСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ЗакрытиеСчетов</Name>
			<BasedOn>
				<xr:Item>Catalog.бит_НастройкиЗакрытия</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий бюджетирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗакрытия</Name>
					<Comment>Вид закрытия счетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыЗакрытияСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиЗакрытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Объект системы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСторно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Закрытие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Comment>ЦФО</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗакрытия</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДтКт</Name>
							<Comment>Указывает куда закрывать, имеет смысл для активно-пассивных счетов</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ДтКт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗакрытия1</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗакрытия2</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗакрытия3</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоЗакрытия4</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеЗакрытия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЖурнала</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Enums/бит_ВидыЗакрытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыЗакрытия</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Простое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_ЗакрытиеСчетов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.бит_ЗакрытиеСчетов.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Документы.бит_ЗакрытиеСчетов.СформироватьПроводки(ПараметрыПроведения.ЗакрытиеСчетовТаблица,
		ПараметрыПроведения.ЗакрытиеСчетов, ПараметрыПроведения.НастройкаЗакрытия, Движения, Отказ);
		
	Документы.бит_ЗакрытиеСчетов.СформироватьПроводки(ПараметрыПроведения.СторноЗакрытиеСчетовТаблица,
		ПараметрыПроведения.СторноЗакрытиеСчетов, ПараметрыПроведения.НастройкаЗакрытия, Движения, Отказ);	
		
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ); 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	НепроверяемыеРеквизиты = Новый Массив; 
	
	Если НЕ Сторно Тогда
		НепроверяемыеРеквизиты.Добавить("ДатаСторно");	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РегистрБухгалтерии) Тогда
		ИмяРегистра = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистрБухгалтерии, "ИмяОбъекта");
		МетаданныеРегистра = Метаданные.РегистрыБухгалтерии.Найти(ИмяРегистра);

		Если МетаданныеРегистра = Неопределено Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не найден регистр бухгалтерии ""%1"".'"), РегистрБухгалтерии) ;
		КонецЕсли;
		
		Если МетаданныеРегистра.Измерения.Найти("Сценарий") = Неопределено Тогда
			НепроверяемыеРеквизиты.Добавить("Сценарий");		
		КонецЕсли;
		Если МетаданныеРегистра = Метаданные.РегистрыБухгалтерии.бит_Бюджетирование Тогда
			НепроверяемыеРеквизиты.Добавить("Организация");
		КонецЕсли;
		Если МетаданныеРегистра.Измерения.Найти("ЦФО") = Неопределено Тогда
			НепроверяемыеРеквизиты.Добавить("Закрытие.ЦФО");		
		КонецЕсли;
	КонецЕсли;
	
	НастройкаИменаРесурсов = НастройкаЗакрытия.ИменаРесурсов.Выгрузить();	
	ДокументИменаРесурсов  = Документы.бит_ЗакрытиеСчетов.ИменаРесурсов();
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.бит_НастройкиЗакрытия") Тогда
		ЗаполнитьПоНастройкеЗакрытия(ДанныеЗаполнения, СтандартнаяОбработка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДатаСторно) Тогда
		ДатаСторно = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет табличную часть "Закрытие".
// 
Процедура ЗаполнитьТчЗакрытие(ПараметрыРБ) Экспорт
	
	НайденоПолеСумма = Истина;
	Для каждого Строка Из НастройкаЗакрытия.Закрытие Цикл
		
		Если Строка.ВидЗакрытия = Перечисления.бит_ВидыЗакрытия.Простое Тогда
			Продолжить;
		КонецЕсли; 
		
		ТаблицаБаза   = Строка.База.Поля;
		ТаблицаДанные = Строка.Данные.Поля;
		ЕстьБаза 	  = Ложь;
		Для каждого ЭлБаза Из ТаблицаБаза Цикл 		
			Если ВРег(ЭлБаза.Синоним) = ВРег("Сумма") Тогда 				
				ЕстьБаза = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		
		ЕстьДанные = Ложь;
		Для каждого ЭлДанные Из ТаблицаДанные Цикл 		
			Если ВРег(ЭлДанные.Синоним) = ВРег("Сумма") Тогда				
				ЕстьДанные = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		
		Если НЕ ЕстьБаза ИЛИ НЕ ЕстьДанные Тогда
		
			НайденоПолеСумма = Ложь;
			Настройка = ?(НЕ ЕстьБаза, "База", "Данные");
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Список ""%1"" не содержит колонку ""Сумма"". Заполнение не возможно. Проверьте настройку ""%2"" строка №%3.'; 
											|en = 'The ""%1""list does not contain the ""Amount"" column. Filling is not possible. Check the setting ""%2"" line №%3.'"), 
						   					Настройка, НастройкаЗакрытия, Формат(Строка.НомерСтроки, "ЧГ="));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, НастройкаЗакрытия, "Объект"); 
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Если НЕ НайденоПолеСумма Тогда 	
		Возврат;		
	КонецЕсли; 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", Организация);
	Если ПараметрыРБ.ЭтоРегистрБюдж Тогда		
		СтруктураПараметров.Вставить("Сценарий", Сценарий);		
	КонецЕсли; 
	СтруктураПараметров.Вставить("Дата"              , Дата);
	СтруктураПараметров.Вставить("НастройкаЗакрытия" , НастройкаЗакрытия);
	СтруктураПараметров.Вставить("КоличествоСубконто", ПараметрыРБ.МинКоличествоСубконто);
	СтруктураПараметров.Вставить("ЕстьПодразделение" , ПараметрыРБ.ЕстьПодразделение);
	
	// Заполним закрытие по настройке закрытия.
	бит_РегламентныеЗакрытия.ЗаполнитьДанныеЗакрытия(Закрытие, СтруктураПараметров);	 		

КонецПроцедуры // ЗаполнитьТчЗакрытие()

// Процедура заполняет документ.
// 
// Параметры:
//  СтруктураЗаполнения - Структура.
//
Процедура ЗаполнитьДокумент(СтруктураЗаполнения) Экспорт

	// Обязательные для заполнения поля: Дата, ВидЗакрытия, НастройкаЗакрытия, Сценарий (бюджетирование).
	Для каждого КлЗнч Из СтруктураЗаполнения Цикл
		ИмяРеквизита = КлЗнч.Ключ;
		Если ИмяРеквизита = "Дата" ИЛИ Метаданные().Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
			ЭтотОбъект[ИмяРеквизита] = КлЗнч.Значение;
		КонецЕсли; 	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ВидЗакрытия) И Не ЗначениеЗаполнено(РегистрБухгалтерии) Тогда
		РегистрБухгалтерии = ВидЗакрытия.РегистрБухгалтерии;
	КонецЕсли;
	
	// Заполняет табличную часть "Закрытие"
	Если ЗначениеЗаполнено(РегистрБухгалтерии) Тогда
		ПараметрыРБ = бит_РегламентныеЗакрытия.ПараметрыРегистраБухгалтерии(РегистрБухгалтерии);
		ЗаполнитьТчЗакрытие(ПараметрыРБ);	
	КонецЕсли;

КонецПроцедуры // ЗаполнитьДокумент()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоНастройкеЗакрытия(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Организация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
	ВидЗакрытия = бит_РегламентныеЗакрытия.ПолучитьВидЗакрытия(Организация, ДанныеЗаполнения, ТекущаяДатаСеанса());
	
	Если ЗначениеЗаполнено(ВидЗакрытия) Тогда
		РегистрБухгалтерии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "РегистрБухгалтерии");
		НастройкаЗакрытия  = ДанныеЗаполнения;	
						
		Если бит_РегламентныеЗакрытия.ЭтоРегистрБюджетирования(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистрБухгалтерии, "ИмяОбъекта")) Тогда
			Сценарий = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойСценарий",
			                                                Пользователи.ТекущийПользователь());
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
